In [4]:
import sqlite3 
import pandas as pd
con = sqlite3.connect('sql-murder-mystery.db')

In [6]:
#Buscar el crimen dada la fecha
query1 = """
SELECT * FROM crime_scene_report WHERE date = '20180115' AND city = 'SQL City'AND type = 'murder'
"""
pd.read_sql(query1 ,con)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [12]:
#buscar a los testigos
query2 = """
SELECT * FROM person WHERE address_street_name = 'Northwestern Dr' ORDER BY address_number DESC Limit 1
"""
pd.read_sql(query2 ,con)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [15]:
#buscar al segundo testigo
query3='''
SELECT * FROM person WHERE address_street_name = 'Franklin Ave' AND name LIKE '%Annabel%'
'''
pd.read_sql(query3 ,con)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [16]:
#buscar las entrevistas 
query4='''
SELECT * FROM interview WHERE person_id IN (14887, 16371)
'''
pd.read_sql(query4 ,con)

   person_id                                         transcript
0      14887  I heard a gunshot and then saw a man run out. ...
1      16371  I saw the murder happen, and I recognized the ...

In [17]:
#buscar con las condiciones dadas del gimnasio 
query5='''
SELECT 
    A.person_id,
    A.name, 
    A.id
FROM 
    get_fit_now_member A
LEFT JOIN 
    get_fit_now_check_in B ON A.id = B.membership_id
WHERE 
    B.check_in_date = 20180109 
    AND B.membership_id LIKE "%48Z%" 
    AND A.membership_status = 'gold';

'''
pd.read_sql(query5 ,con)

   person_id           name     id
0      28819   Joe Germuska  48Z7A
1      67318  Jeremy Bowers  48Z55

In [19]:
#Buscar la placa
query6='''
SELECT 
    B.id,
    B.name,
    A.car_model,
    A.plate_number
FROM 
    person B
LEFT JOIN 
    drivers_license A ON B.license_id = A.id
WHERE 
    B.id IN (28819, 67318);
'''
pd.read_sql(query6 ,con)

      id           name car_model plate_number
0  28819   Joe Germuska      None         None
1  67318  Jeremy Bowers  Spark LS       0H42W2

In [21]:
#verificacion
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Jeremy Bowers')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

"Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villian behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer."

In [22]:
#buscar entrevista de jeremy
query7='''
SELECT * FROM interview WHERE person_id = 67318
'''
pd.read_sql(query7,con)

   person_id                                         transcript
0      67318  I was hired by a woman with a lot of money. I ...

In [26]:
query8='''
SELECT 
    A.id, 
    A.name, 
    C.annual_income, 
    D.event_name, 
    D.date, 
    B.*
FROM 
    drivers_license B
INNER JOIN 
    person A ON B.id = A.license_id
INNER JOIN 
    income C ON A.ssn = C.ssn
INNER JOIN 
    facebook_event_checkin D ON A.id = D.person_id
WHERE 
    B.gender = 'female'
    AND B.car_make = 'Tesla'
    AND B.car_model = 'Model S'
    AND B.height BETWEEN 65 AND 67
    AND B.hair_color = 'red'
Limit 1;
'''
pd.read_sql(query8,con)

,id,name,annual_income,event_name,date,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,99716,Miranda Priestly,310000,SQL Symphony Concert,20171206,202298,68,66,green,red,female,500123,Tesla,Model S

In [27]:
#verificar
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Miranda Priestly')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

'Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!'